thomsardi/stm32-lvd/src/main.cpp
#include <Arduino.h>
#include <CANController.h>
#include <STM32FreeRTOS.h>
#include <Beastdevices_INA3221.h>
#include <DataDef.h>
#include <BatteryProcessing.h>
#include <EEPROM.h>
#include <Pack.h>

#define ON1 PA5 //  Vsat
#define ON2 PA6 //  BTS
#define ON3 PA7 //  Other
#define OFF1 PB0  //  Vsat
#define OFF2 PB1  //  BTS
#define OFF3 PB10 //  Other

/**
 * Pin remap
*/
#define VSAT_ON PA7
#define VSAT_OFF  PB10
#define BTS_ON  PA6
#define BTS_OFF PB1
#define OTHER_ON  PA5
#define OTHER_OFF PB0

#define FB1 PB14  //  Vsat
#define FB2 PB13  //  BTS
#define FB3 PB12  //  Other

#define LVD_LOW_VSAT_ADDR 0
#define LVD_LOW_OTHER_ADDR 4
#define LVD_LOW_BTS_ADDR 8
#define LVD_RECONNECT_VSAT_ADDR 12
#define LVD_RECONNECT_OTHER_ADDR  16
#define LVD_RECONNECT_BTS_ADDR  20
#define LVD_TOLERANCE_ADDR 24
#define NOMINAL_BAT_ADDR 28
#define UNIQUE_ID_ADDR 32
#define FLAG_SET_ADDR 36

#define SOFTWARE_VERSION 2

#define idCanbusEnergyMeter 0x1D40C8E7

CANController can;
Beastdevices_INA3221 ina3221b(INA3221_ADDR40_GND);
BatteryProcessing batProc;
AdditionalCANData additionalCanData;
AlarmParameter voltageAlarm = {4600, 4600, 4700, 4700, 4700, 4800};
TaskHandle_t relayTaskHandle;
TaskHandle_t canSenderTaskHandle;
// TaskHandle_t ina3221TaskHandle;

SemaphoreHandle_t myLock = xSemaphoreCreateMutex();

// QueueHandle_t relayTaskQueue;
QueueHandle_t canSenderTaskQueue;

uint32_t count;
uint32_t count2;
uint16_t uniqueId = 160;
uint8_t lostConnectionCounter = 0;
bool isOverriden;
unsigned long lastTime = 0;
unsigned long lastCheckTime = 0;

BatteryData batteryData[24];
size_t batterySize = sizeof(batteryData) / sizeof(batteryData[0]);

CAN_msg_t canMsgStorage[12];
Vector<CAN_msg_t> canTxBuffer(canMsgStorage);

BatteryData dummyData[24];
Pack packData(dummyData, 24, 0);

EhubRelayWrite ehubRelay;
KeepAliveCounter keepAliveCounter;
bool isDataReady = false;
// put function declarations here:

/**
 * @brief callback to handle CAN data message
 *        @note register the callback first to CanController object, each time can receive data, this callback will be called
 * @param msg   CAN data message
*/
void canHandler(CAN_msg_t msg)
{
  uint32_t frameId = msg.id;
  HalfPackData halfPackData;
  HalfMosfetData halfMosfetData;
  int length = msg.len;
  int index = 0;
  int baseAddr = 0;
  // Serial1.print("Frame Addr : ");
  // Serial1.println(frameId, HEX);
  // Serial1.print("Data : ");
  // for (int index = 0; index < msg.len; index ++)
  // {
  //   Serial1.print(msg.data[index]);
  //   Serial1.print(" ");
  // }
  // Serial1.println();
  // return;
  // Serial1.println((frameId & 0xFFFFFFC0), HEX);
  switch (frameId & 0xFFFFFFC0) //Since the id of battery is different, the changing value needs to be eliminate by bit AND it with 0
  {
  case PACK_DATA: //if the frame is for PACK_DATA, update the respective struct
    baseAddr = static_cast<int>(PACK_ADDR);
    index = baseAddr - frameId; // find the id of the device
    // Serial1.println("Index : " + String(index));
    // return;
    // index = abs(index);
    // Serial1.println("index : " + String(index));
    // for (size_t i = 0; i < length; i++)
    // {
    //   Serial1.print(msg.data[i], HEX);
    //   Serial1.print(" ");
    // }
    halfPackData.id = index;
    halfPackData.isUpdated = 1;
    halfPackData.packVoltage = batProc.getPackVoltage(msg, 2, 2);
    halfPackData.packCurrent = batProc.getPackCurrent(msg, 4, 2);
    halfPackData.packSoc = batProc.getPackSoc(msg, 6, 2);
    packData.insert(halfPackData);  //insert the data, overwrite the existing or add new data
    isDataReady = true;
    // batteryData[index - 1].id = index;
    // batteryData[index - 1].isUpdated = 1;
    // batteryData[index - 1].packVoltage = batProc.getPackVoltage(msg, 2, 2);
    // batteryData[index - 1].packCurrent = batProc.getPackCurrent(msg, 4, 2);
    // batteryData[index - 1].packSoc = batProc.getPackSoc(msg, 6, 2);
    // batteryData[index - 1].incPackCounter();
    // Serial1.println("Id : " + String(index));
    // Serial1.println("Pack Voltage : " + String(batteryData[index - 1].packVoltage));
    // Serial1.println("Pack Current : " + String(batteryData[index - 1].packCurrent));
    // Serial1.println("Pack Soc : " + String(batteryData[index - 1].packSoc));
    // return;
    break;
  case MOSF_TEMP :  //if the frame is for MOSF_TEMP, update the respective struct
    baseAddr = static_cast<int>(MOSF_TEMP_ADDR);
    index = baseAddr - frameId;

    halfMosfetData.id = index;
    halfMosfetData.isUpdated = 1;
    batProc.updateMosfetStatus(msg.data[0], halfMosfetData);
    halfMosfetData.temperature.top = batProc.getTemperature(msg,3, 1);
    halfMosfetData.temperature.mid = batProc.getTemperature(msg,4, 1);
    halfMosfetData.temperature.bot = batProc.getTemperature(msg,5, 1);
    halfMosfetData.temperature.cmosTemp = batProc.getTemperature(msg,6, 1);
    halfMosfetData.temperature.dmosTemp = batProc.getTemperature(msg,7, 1);

    CAN_msg_t txBuff;
    
    if (halfMosfetData.temperature.dmosTemp < 50)
    {
      /* code */
      // Serial1.println("ID : " + String(index));
      // Serial1.println("Dmos temperature normal");
      if (!halfMosfetData.mosfetStatus.dmos)
      { 
        // Serial1.println("Dmos Off");
        /**
         * @brief Force dmos on when the received dmos status is off
         *        @note 4 frame data need to be sent in order to activate dmos, the frame data pushed into queue
         *              to be later handled by canSenderTask
        */
        //First frame data
        txBuff.id = CMOS_DMOS_CONTROL_ADDR_1 + (index << 8);
        txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
        txBuff.type = CAN_FRAME::DATA_FRAME;
        txBuff.len = 8;
        txBuff.data[0] = MosfetType::DISCHARGE_MOSFET_TYPE; //mosfet type for discharge
        txBuff.data[1] = 0x64;
        txBuff.data[2] = MosfetSelector::DISCHARGE_MOSFET_SELECTOR;
        txBuff.data[3] = 0x64;
        txBuff.data[4] = 0x64;
        txBuff.data[5] = 0x64;
        txBuff.data[6] = 0x63;
        txBuff.data[7] = 0x64;
        xQueueSend(canSenderTaskQueue, &txBuff, 0);
        // canTxBuffer.push_back(txBuff);

