thomsardi/stm32-lvd/src/main.cpp
        //Second frame data
        // txBuff.id = CMOS_DMOS_CONTROL_ADDR_2 - (index << 8);
        // txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
        // txBuff.type = CAN_FRAME::DATA_FRAME;
        // txBuff.len = 3;
        // txBuff.data[0] = MosfetType::DISCHARGE_MOSFET_TYPE; //mosfet type for discharge
        // txBuff.data[1] = 0x64;
        // txBuff.data[2] = 0x64;
        // txBuff.data[3] = 0x64;  //don't care
        // txBuff.data[4] = 0x64;  //don't care
        // txBuff.data[5] = 0x64;  //don't care
        // txBuff.data[6] = 0x63;  //don't care
        // txBuff.data[7] = 0x64;  //don't care
        // canTxBuffer.push_back(txBuff);

        //Third frame data  
        txBuff.id = CMOS_DMOS_CONTROL_ADDR_3 + (index << 8);
        txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
        txBuff.type = CAN_FRAME::DATA_FRAME;
        txBuff.len = 6;
        txBuff.data[0] = MosfetType::DISCHARGE_MOSFET_TYPE; //mosfet type for discharge
        txBuff.data[1] = 0x64;
        txBuff.data[2] = MosfetState::ON_STATE;
        txBuff.data[3] = 0x64;  
        txBuff.data[4] = 0x64;  
        txBuff.data[5] = 0x64;  
        txBuff.data[6] = 0x63;  //don't care
        txBuff.data[7] = 0x64;  //don't care
        xQueueSend(canSenderTaskQueue, &txBuff, 0);
        // canTxBuffer.push_back(txBuff);

        //Fourth frame data  
        // txBuff.id = CMOS_DMOS_CONTROL_ADDR_4 - (index << 8);
        // txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
        // txBuff.type = CAN_FRAME::DATA_FRAME;
        // txBuff.len = 3;
        // txBuff.data[0] = MosfetType::DISCHARGE_MOSFET_TYPE; //mosfet type for discharge
        // txBuff.data[1] = 0x64;
        // txBuff.data[2] = 0x64;
        // txBuff.data[3] = 0x64;  //don't care
        // txBuff.data[4] = 0x64;  //don't care
        // txBuff.data[5] = 0x64;  //don't care
        // txBuff.data[6] = 0x63;  //don't care
        // txBuff.data[7] = 0x64;  //don't care
        // canTxBuffer.push_back(txBuff);      
      }
    }
    else
    {
      // Serial1.println("ID : " + String(index));
      // Serial1.println("Dmos temperature abnormal");
    }
    
    if (halfMosfetData.temperature.cmosTemp < 50)
    {
      /* code */
      // Serial1.println("ID : " + String(index));
      // Serial1.println("Cmos temperature normal");
      if (!halfMosfetData.mosfetStatus.cmos)
      { 
        // Serial1.println("Cmos Off");
        /**
         * @brief Force cmos on when the received cmos status is off
         *        @note 4 frame data need to be sent in order to activate cmos, the frame data pushed into queue
         *              to be later handled by canSenderTask
        */
        //First frame data
        txBuff.id = CMOS_DMOS_CONTROL_ADDR_1 + (index << 8);
        txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
        txBuff.type = CAN_FRAME::DATA_FRAME;
        txBuff.len = 8;
        txBuff.data[0] = MosfetType::CHARGE_MOSFET_TYPE; //mosfet type for charge
        txBuff.data[1] = 0x64;
        txBuff.data[2] = MosfetSelector::CHARGE_MOSFET_SELECTOR;
        txBuff.data[3] = 0x64;
        txBuff.data[4] = 0x64;
        txBuff.data[5] = 0x64;
        txBuff.data[6] = 0x63;
        txBuff.data[7] = 0x64;
        xQueueSend(canSenderTaskQueue, &txBuff, 0);

        //Second frame data
        // txBuff.id = CMOS_DMOS_CONTROL_ADDR_2 - (index << 8);
        // txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
        // txBuff.type = CAN_FRAME::DATA_FRAME;
        // txBuff.len = 3;
        // txBuff.data[0] = MosfetType::CHARGE_MOSFET_TYPE; //mosfet type for charge
        // txBuff.data[1] = 0x64;
        // txBuff.data[2] = 0x64;
        // txBuff.data[3] = 0x64;  //don't care
        // txBuff.data[4] = 0x64;  //don't care
        // txBuff.data[5] = 0x64;  //don't care
        // txBuff.data[6] = 0x63;  //don't care
        // txBuff.data[7] = 0x64;  //don't care
        // xQueueSend(canSenderTaskQueue, &txBuff, 0);  

        //Third frame data  
        txBuff.id = CMOS_DMOS_CONTROL_ADDR_3 + (index << 8);
        txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
        txBuff.type = CAN_FRAME::DATA_FRAME;
        txBuff.len = 6;
        txBuff.data[0] = MosfetType::CHARGE_MOSFET_TYPE; //mosfet type for charge
        txBuff.data[1] = 0x64;
        txBuff.data[2] = MosfetState::ON_STATE;
        txBuff.data[3] = 0x64;  
        txBuff.data[4] = 0x64;  
        txBuff.data[5] = 0x64;  
        txBuff.data[6] = 0x63;  //don't care
        txBuff.data[7] = 0x64;  //don't care
        xQueueSend(canSenderTaskQueue, &txBuff, 0);

        //Fourth frame data  
        // txBuff.id = CMOS_DMOS_CONTROL_ADDR_4 - (index << 8);
        // txBuff.format = CAN_FORMAT::EXTENDED_FORMAT;
        // txBuff.type = CAN_FRAME::DATA_FRAME;
        // txBuff.len = 3;
        // txBuff.data[0] = MosfetType::CHARGE_MOSFET_TYPE; //mosfet type for charge
        // txBuff.data[1] = 0x64;
        // txBuff.data[2] = 0x64;
        // txBuff.data[3] = 0x64;  //don't care
        // txBuff.data[4] = 0x64;  //don't care
        // txBuff.data[5] = 0x64;  //don't care
        // txBuff.data[6] = 0x63;  //don't care
        // txBuff.data[7] = 0x64;  //don't care
        // xQueueSend(canSenderTaskQueue, &txBuff, 0);
      }
    }
    else
    {
      // Serial1.println("ID : " + String(index));
      // Serial1.println("Cmos temperature abnormal");
    }
    
    packData.insert(halfMosfetData);

    // batteryData[index - 1].id = index;
    // batteryData[index - 1].isUpdated = 1;    
    // batProc.updateMosfetStatus(msg.data[0], batteryData[index-1]);
    // batteryData[index - 1].temperature.top = batProc.getTemperature(msg,3, 1);
    // batteryData[index - 1].temperature.mid = batProc.getTemperature(msg,4, 1);
    // batteryData[index - 1].temperature.bot = batProc.getTemperature(msg,5, 1);
    // batteryData[index - 1].temperature.cmosTemp = batProc.getTemperature(msg,6, 1);
    // batteryData[index - 1].temperature.dmosTemp = batProc.getTemperature(msg,7, 1);
    // batteryData[index - 1].incMosfetCounter();
    // Serial1.println("Id : " + String(index - 1));
    // Serial1.println("Mosfet Status : " + String(batteryData[index - 1].mosfetStatus.val));
    // Serial1.println("Temperature Top : " + String(batteryData[index - 1].temperature.top));
    // Serial1.println("Temperature Mid : " + String(batteryData[index - 1].temperature.mid));
    // Serial1.println("Temperature Bot : " + String(batteryData[index - 1].temperature.bot));
    // Serial1.println("Temperature Cmos : " + String(batteryData[index - 1].temperature.cmosTemp));
    // Serial1.println("Temperature Dmos : " + String(batteryData[index - 1].temperature.dmosTemp));
    // return;
    break;

  default:
    break;
  }
  // return;

  if (frameId == 0x1D41C8E6) //ehub write lvd low config
  {
    // Serial1.println("Write lvd low config");
    voltageAlarm.vsatLowVoltage = (msg.data[1] << 8) + msg.data[0];
    uint16_t temp;
    EEPROM.get(LVD_LOW_VSAT_ADDR, temp);  //get the value from eeprom
    if(temp != voltageAlarm.vsatLowVoltage) //check if the value is same, eeprom doesn't need to be updated, prolong the eeprom life
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_LOW_VSAT_ADDR, voltageAlarm.vsatLowVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    voltageAlarm.otherLowVoltage = (msg.data[3] << 8) + msg.data[2];
    EEPROM.get(LVD_LOW_OTHER_ADDR, temp); //get the value from eeprom
    if(temp != voltageAlarm.otherLowVoltage)  //check if the value is same, eeprom doesn't need to be updated, prolong the eeprom life
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_LOW_OTHER_ADDR, voltageAlarm.otherLowVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    voltageAlarm.btsLowVoltage = (msg.data[5] << 8) + msg.data[4];
    EEPROM.get(LVD_LOW_BTS_ADDR, temp); //get the value from eeprom
    if(temp != voltageAlarm.btsLowVoltage)  //check if the value is same, eeprom doesn't need to be updated, prolong the eeprom life
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_LOW_BTS_ADDR, voltageAlarm.btsLowVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

